---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCAnyHandle.Id
source: html/148af05e-46e3-18bc-95c6-2ab1fa6bacc8.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.Id Property

The integer identifier for the handle.

## Syntax (C#)
```csharp
public int Id { get; }
```